#include <iostream>

int main(){
    //常量指针:修饰的是指针（地址），说明可以操作的是指针的指向，但是地址所指的值不能进行修改
    int a = 10;
    int b = 20;
    const int* p = &a;
    //*p = 20; 错误，不能穿透地址到值，修饰的是地址，所以地址背后映射的值（解引用）不可以修改
    p = &b;//正确，可以修改地址值，但是p没有被修饰，所以p（也就是指向的地址）是可以被修改的

    //指针常量：修饰的是常量，说明可以操作的是指针指向的具体值，不可以修改指针的指向
    int* const p1 = &a;
    //p1 = &b; 错误，不能修改地址值，因为修饰的是p1,所以不能对p1的值进行修改
    *p1 = 20;//正确，可以修改指向的地址的实际值

    //const既修饰指针又修饰变量
    const int* const p2 = &a;
    // p2 = &b;
    // *p2 = 20;
    //兼容上述：既不可修改指向又不可以修改指向的实际值

    return 0;
}