#include <iostream>

int main(){
    int a = 10;
    //定义指针
    int* p;

    //让指针记录变量a的地址
    p = &a;
    std::cout<<"a的地址是:"<<&a<<std::endl;
    //其实&a的类型就是int*
    std::cout<<"指针p其实就是a的地址:"<<p<<std::endl;
    //p一方面是指针变量，属于变量范畴，自己会开辟内存空间；
    //p另一方面是指针值，类型就是变量a的地址类型即int*，指针值就是a的地址值
    std::cout<<"p的地址是:"<<&p<<std::endl;
    //p就是指针变量就是地址，它本身就是一块地址，它里面存储的是a的地址
    //区别在与：读取地址的方式——也就是解引用的方式，如果是int*的地址，*p就直接读4字节，如果是char*地址，*p就读1字节
    //指针运算的步长也是按照地址类型来的，对于int*来说，p+1就是加4,而对char*就是加1

    //使用指针
    std::cout<<"a的大小是:"<<*p<<std::endl;

    return 0;
}