#include <iostream>

int main(){
    int arr[10] = {1,2,3,4,5,6,7,8,9,10};
    int* p = arr;//arr就是数组首地址
    std::cout<<"第一个元素："<<*p<<std::endl;
    //p存放的是arr数组的首地址，由于是int*类型的地址，结合之前对于地址（指针）类型的解释，按照int*地址类型大小进行读取相关数据
    p++;//p=p+1;
    //上述中对于为什么解引用只能获取到第一个元素解释的很清楚了，关键在于p的类型就是int*大小的地址，进行数据解析时就是按照int的大小进行解析（读数据的方式）
    //记住：指针p的大小也就是不管是int*还是char*占用的内存空间就是8字节（64位下）
    std::cout<<"第二个元素："<<*p<<std::endl;

    int* p2 = arr;
    for(int i = 0 ; i<10 ; i++){
        std::cout<<"读取数组中的元素"<<i+1<<":"<<*p2<<std::endl;
        p2++;
    };

    return 0;
}